package org.firstinspires.ftc.teamcode.scenes.tele.field;

import com.qualcomm.robotcore.eventloop.opmode.TeleOp;
import com.qualcomm.robotcore.hardware.DcMotor;

import org.firstinspires.ftc.teamcode.func.classes.driverhelperv2.DriverHelperWithStates;
import org.firstinspires.ftc.teamcode.scenes.superclasses.TeleOpPack;

@TeleOp(name = "Я в своем познании настолько преисполнился, что я как будто бы уже\n" +
        "\n" +
        "сто триллионов миллиардов лет проживаю на триллионах и\n" +
        "\n" +
        "триллионах таких же планет, как эта Земля, мне этот мир абсолютно\n" +
        "\n" +
        "понятен, и я здесь ищу только одного - покоя, умиротворения и\n" +
        "\n" +
        "вот этой гармонии, от слияния с бесконечно вечным, от созерцания\n" +
        "\n" +
        "великого фрактального подобия и от вот этого замечательного всеединства\n" +
        "\n" +
        "существа, бесконечно вечного, куда ни посмотри, хоть вглубь - бесконечно\n" +
        "\n" +
        "малое, хоть ввысь - бесконечное большое, понимаешь? А ты мне опять со\n" +
        "\n" +
        "своим вот этим, иди суетись дальше, это твоё распределение, это\n" +
        "\n" +
        "твой путь и твой горизонт познания и ощущения твоей природы, он\n" +
        "\n" +
        "несоизмеримо мелок по сравнению с моим, понимаешь? Я как будто бы уже\n" +
        "\n" +
        "давно глубокий старец, бессмертный, ну или там уже почти бессмертный,\n" +
        "\n" +
        "который на этой планете от её самого зарождения, ещё когда только Солнце\n" +
        "\n" +
        "только-только сформировалось как звезда, и вот это газопылевое облако,\n" +
        "\n" +
        "вот, после взрыва, Солнца, когда оно вспыхнуло, как звезда, начало\n" +
        "\n" +
        "формировать вот эти коацерваты, планеты, понимаешь, я на этой Земле уже\n" +
        "\n" +
        "как будто почти пять миллиардов лет живу и знаю её вдоль и поперёк\n" +
        "\n" +
        "этот весь мир, а ты мне какие-то... мне не важно на твои тачки, на твои\n" +
        "\n" +
        "яхты, на твои квартиры, там, на твоё благо. Я был на этой\n" +
        "\n" +
        "планете бесконечным множеством, и круче Цезаря, и круче Гитлера, и круче\n" +
        "\n" +
        "всех великих, понимаешь, был, а где-то был конченым говном, ещё хуже,\n" +
        "\n" +
        "чем здесь. Я множество этих состояний чувствую. Где-то я был больше\n" +
        "\n" +
        "подобен растению, где-то я больше был подобен птице, там, червю, где-то\n" +
        "\n" +
        "был просто сгусток камня, это всё есть душа, понимаешь? Она имеет грани\n" +
        "\n" +
        "подобия совершенно многообразные, бесконечное множество. Но тебе этого\n" +
        "\n" +
        "не понять, поэтому ты езжай себе , мы в этом мире как бы живем\n" +
        "\n" +
        "разными ощущениями и разными стремлениями, соответственно, разное наше и\n" +
        "\n" +
        "место, разное и наше распределение. Тебе я желаю все самые крутые тачки\n" +
        "\n" +
        "чтоб были у тебя, и все самые лучше самки, если мало идей, обращайся ко мне, я тебе на каждую твою идею предложу сотню триллионов, как всё делать. Ну а я всё, я иду как глубокий старец,узревший вечное, прикоснувшийся к Божественному, сам стал богоподобен и устремлен в это бесконечное, и который в умиротворении, покое, гармонии, благодати, в этом сокровенном блаженстве пребывает, вовлеченный во всё и во вся, понимаешь, вот и всё, в этом наша разница. Так что я иду любоваться мирозданием, а ты идёшь преисполняться в ГРАНЯХ каких-то, вот и вся разница, понимаешь, ты не зришь это вечное бесконечное, оно тебе не нужно. Ну зато ты, так сказать, более активен, как вот этот дятел долбящий, или муравей, который очень активен в своей стезе, поэтому давай, наши пути здесь, конечно, имеют грани подобия, потому что всё едино, но я-то тебя прекрасно понимаю, а вот ты меня - вряд ли, потому что я как бы тебя в себе содержу, всю твою природу, она составляет одну маленькую там песчиночку, от того что есть во мне, вот и всё, поэтому давай, ступай, езжай, а я пошел наслаждаться прекрасным осенним закатом на берегу теплой южной реки. Всё, ступай, и я пойду.")
public class teleopv42 extends TeleOpPack {
    public DriverHelperWithStates dhv42;
    @Override
    public void doSetup() {
        R.imuv2.reset();
        dhv42 = new DriverHelperWithStates(R);
        R.lift.L.setMode(DcMotor.RunMode.STOP_AND_RESET_ENCODER);
        R.lift.L.setMode(DcMotor.RunMode.RUN_USING_ENCODER);
        R.lift.L_L.setMode(DcMotor.RunMode.STOP_AND_RESET_ENCODER);
        R.lift.L_L.setMode(DcMotor.RunMode.RUN_USING_ENCODER);
    }
    @Override
    public void doSetupMovings() {
        dhv42.GrabDH.open();
    }
    @Override
    public void doActions() {
        dhv42.tick();
        R.wb.tele();
        R.gb.tele();
        R.lift.tele();
        telemetry.addData("dhstate", dhv42.DHState);
        telemetry.addData("now x", dhv42.GrabDH.curPos_ox);
        telemetry.addData("now y", dhv42.GrabDH.curPos_oy);
        telemetry.addData("lc pos", R.lift.L.getCurrentPosition());
        telemetry.addData("ll pos", R.lift.L_L.getCurrentPosition());
        telemetry.addData("target lc", dhv42.LiftDH.DLPID.getTargetLc());
        telemetry.addData("target ll", dhv42.LiftDH.DLPID.getTargetLl());
        telemetry.update();
    }
}
